Revit 2026 API

# ElementGetSubelements Method

---

Returns the collection of element subelements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Subelement> GetSubelements()
```
```vb
Public Function GetSubelements As IList(Of Subelement)
```
```cpp
public:
IList<Subelement^>^ GetSubelements()
```
```fsharp
member GetSubelements : unit -> IList<Subelement>
```

#### Return Value

IListSubelement The collection of element subelements.

This collection will not include the Element itself.

#### Reference

Element Class

Autodesk.Revit.DB Namespace